// vitrina_1c v3.3 — Выгрузка каталога товаров на хостинг
// https://github.com/antoshik86/vitrina_1c
// 2026-06-05 22:05 +07:00

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Группа = Элементы.Добавить("ГруппаКорень", Тип("ГруппаФормы"));
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	Надпись = Элементы.Добавить("НадписьПривет", Тип("ПолеФормы"), Группа);
	Надпись.Заголовок = "vitrina_1c v3.3 — работает!";
	Надпись.Вид = ВидПоляФормы.ПолеНадписи;
КонецПроцедуры