Функция СведенияОВнешнейОбработке() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Версия", "2.3");
	ПараметрыРегистрации.Вставить("Назначение", "Выгрузка каталога товаров на сайт-витрину v2.3");
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Идентификатор");
	Команды.Колонки.Добавить("Представление");
	Команды.Колонки.Добавить("ПоказыватьОповещение");
	Команды.Колонки.Добавить("Использование");
	НоваяСтрока = Команды.Добавить();
	НоваяСтрока.Идентификатор = "Выгрузить";
	НоваяСтрока.Представление = "Выгрузить каталог на хостинг";
	НоваяСтрока.ПоказыватьОповещение = Ложь;
	НоваяСтрока.Использование = "ИзМеню";
	ПараметрыРегистрации.Вставить("Команды", Команды);
	Возврат ПараметрыРегистрации;
КонецФункции
